<template>
  <div class="about" style="margin-left: 30px">
    <h2 align="left">关于</h2>
    <div style="background-color: rgba(255, 255, 255, 0.7) !important;margin-right:30px;">
      <p align="left">
        Yuki Clanbattle建设中 <a href="https://github.com/ColdThunder11/yuki_clanbattle">Github地址</a>
      </p>
      <p align="left">当前版本：v0.2.0</p>
      <p align="left">
        Change Log: <br />
        v0.2.0<br />
        新增：国服会战模式支持<br />
        新增：查询指定刀数的成员的指令<br />
        新增：删除公会指令<br />
        新增：群内提醒出刀指令<br />
        改进：Web端显示当前公会名称<br />
        v0.1.7<br />
        改进：代理报刀以后自动清除代报人的预约、出刀、挂树状态<br />
        改进：代理报刀支持省略boss序号<br />
        v0.1.6<br />
        新增：可以在Web中查看当日的三刀详情了(出刀统计->三刀视图)<br />
        改进：出刀统计中会显示成员总数了<br />
        新增：查刀+at指定成员可以在群内查询指定成员当天的出刀记录<br />
        新增：可以使用取消挂树/下树来直接取消挂树状态（警惕虚假挂树诈骗）<br />
        改进：撤销报刀不带几王时默认撤销自己最近的一次报刀<br />
        改进：可以直接使用sl?来查询是否使用sl<br />
        改进：查树显示优化<br />
        改进：数字显示优化<br />
        v0.1.5<br />
        新增：可以在Web中修改进度了<br />
        新增：Web新增了会战统计页面<br />
        <!--v0.1.4<br />
        新增：部分指令允许更多别名，允许更新申请出刀和挂树备注，详见指南页面<br />
        完善：更详细的指南页面<br />
        修正：挂树的时候sl未能正常退出挂树状态的问题<br />
        修正：可以同时处于申请出刀和挂树状态的问题<br />
        v0.1.3<br />
        新增：修改进度指令<br />
        新增：可以在Web中移除多余的公会成员<br />
        修正：亿些小bug<br />
        <br />
        v0.1.2<br />
        新增：加入全部成员指令<br />
        新增：切换和清空会战档案指令<br />
        新增：Web多公会选择界面<br />
        改进：性能改进，为大部分查询指令添加了缓存<br />
        修正：亿些小bug<br />
        <br />
        v0.1.1<br />
        修复：可以在无法挑战的Boss上SL和挂树的问题<br />
        修复：退出公会出现错误的问题<br />
        修复：网页预约出现错误的问题<br />
        修正：网页报刀在不选择代理成员的情况下的错误提示<br />
        改进：完善尾刀和补偿刀的出刀逻辑<br />
        改进：增加单独的查树指令 -->
      </p>
    </div>
  </div>
</template>
